In [1]:
import numpy as np
import pandas as pd

In [2]:
# Create list
movies = ["Titanic", "Like Mike", "Back 2 the Future"]


# Creae a series
moives_Srs = pd.Series(movies)
print(moives_Srs)
# (col_num, list)

0              Titanic
1            Like Mike
2    Back 2 the Future
dtype: object

In [3]:
print(moives_Srs.head()) # first couple

0              Titanic
1            Like Mike
2    Back 2 the Future
dtype: object

In [4]:
print(moives_Srs.tail())

0              Titanic
1            Like Mike
2    Back 2 the Future
dtype: object

In [5]:
data = {
    "name": ["Sally", "Mary", "John"],
    "age": [ 50, 40, 30],
    "qualified": [True, False, False]
}

df = pd.DataFrame(data)
# using dict, json, excel, api. csn, tsv, and more

print("OG DataFrame")
df

OG DataFrame

    name  age  qualified
0  Sally   50       True
1   Mary   40      False
2   John   30      False

In [6]:
new_df = df.rename(columns={"name": "Name", "age": "Age", "qualified": "Is" }, 
                   index={0: 'a', 1: 'b', 2: 'c' })
print("DataFrame After Renaming")
new_df

DataFrame After Renaming

    Name  Age     Is
a  Sally   50   True
b   Mary   40  False
c   John   30  False

In [7]:
new_df = new_df.sort_values("Name")
new_df

    Name  Age     Is
c   John   30  False
b   Mary   40  False
a  Sally   50   True

In [8]:
new_df.loc['c', 'Name']

'John'

In [9]:
new_df.drop('Is', axis='columns', inplace=True)

In [10]:
new_df

    Name  Age
c   John   30
b   Mary   40
a  Sally   50

In [21]:
data = {"Mike": np.random.randint(5, 100, 12),
       "Amy": np.random.randint(5, 100, 12),
       "Billy": np.random.randint(5, 100, 12),
        "Mandy": np.random.randint(5, 100, 12)}
df3 = pd.DataFrame(data)

In [22]:
print(df3.head(10))

   Mike  Amy  Billy  Mandy
0    50   72     59     21
1    74   38     97     48
2    34   69     84     86
3    41   20     95     98
4    32   32     68     67
5    46   79     71     18
6    80   92     45     79
7     6   59     16     24
8    19   46     94     26
9    89   51     68     59

In [25]:
df.iloc(0)